[
    {
        "name": "RPI CSCI HW Server",
        "thumbnail": "hwserver.png",
        "description": "I'm part of the team that devlopes the HW Server written to support RPI's CSCI classes it features a php website and then a C++ backend that can compile and run student's submissions against a variety of teacher created test cases. Additionally, TAs can then use the system to grade the student's submissions from an easy to use web interface. It also supports holding grades for labs, exams, and other variety of assignments. I've primarily worked on the TA Grading website, though contribute elsewhere as necessary.",
        "github": "https://github.com/Submitty/Submitty"
    },
    {
        "name": "SomethingAwful Last Read Redux",
        "thumbnail": "salr.jpg",
        "description": "Written in Javascript/jQuery, this chrome extension is a fork of the \"SomethingAwful Last Read\" (SALR) extension written by <a target='_blank' href='https://github.com/scottferg'>Scott Ferguson</a> as he gave up maintaining it in April 2013. Since then I've supported the extension by adding new user request features, fixing bugs, improving performance of the underlying jQuery usage, and all around kept the extension alive for improving the SomethingAwful browsing experience.",
        "github": "https://github.com/MasterOdin/salr-chrome",
        "chrome": "https://chrome.google.com/webstore/detail/something-awful-last-read/bogegdelcjhoaakaepmoglademmhiboo"
    },
    {
        "name": "8-Block Sliding Puzzle",
        "thumbnail": "8block.jpg",
        "description": "Written in Python, this is an implementation of the A* algorithm to solve the 8-block sliding puzzle using the <a target='_blank' href='http://www.improvedoutcomes.com/docs/WebSiteDocs/Clustering/Clustering_Parameters/Manhattan_Distance_Metric.htm'>Manhattan Distance</a> Heuristic. It accepts as input 3 numbers per 3 lines (enter three numbers with spaces, then hit enter, three spaces, etc.). It provides checking on whether or not the given puzzle is solvable before attempting, and then solves the puzzle, outputting the shortest path to the goal state.",
        "github": "https://github.com/MasterOdin/8block-sliding-puzzle"
    },
    {
        "name": "Context-Free Grammar to Chomsky-Normal Form Generator",
        "thumbnail": "cfg2cnf.jpg",
        "description": "Written in PHP, this is a generator that takes in a <a target='_blank' href='https://en.wikipedia.org/wiki/Context-free_grammar'>Content-Free Grammar</a> and converts it to <a target='_blank' href='https://en.wikipedia.org/wiki/Chomsky_normal_form'>Chomksy Normal Form</a> through the algorithm stated on the wikipedia page for CNF.",
        "github": "https://github.com/MasterOdin/cfg2cnf",
        "demo": "http://mpeveler.com/assets/content/projects/cfg2cnf.php"
    }
]